import pytest
import pandas
import datetime
import json

@pytest.fixture
def operations_excel_file_path():

    return r'C:\Users\liudo\PycharmProjects\Project1_eroshkinalv\data\operations.xlsx'


@pytest.fixture
def operations_excel_file_content():

    return pandas.DataFrame({'Дата операции': ['01.12.2021 23:40:34', '01.12.2021 18:50:24'],
                             'Дата платежа': ['02.12.2021', '01.12.2021'],
                             'Номер карты': ['*5091', '*7197'],
                             'Статус': ['OK', 'OK'],
                             'Сумма операции': [-1.07, -99.22],
                             'Валюта операции': ['RUB', 'RUB'],
                             'Сумма платежа': [-1.07, -99.22],
                             'Валюта платежа': ['RUB', 'RUB'],
                             'Кэшбэк': [0, 0],
                             'Категория': ['Каршеринг', 'Супермаркеты'],
                             'MCC': [7512, 5411],
                             'Описание': ['Ситидрайв', 'Дикси'],
                             'Бонусы (включая кэшбэк)': [0.00, 1.00],
                             'Округление на инвесткопилку': [0.00, 0.00],
                             'Сумма операции с округлением': [1.07, 99.22]})


@pytest.fixture
def current_date_and_time():

    return datetime.datetime.strptime('2021-12-01 23:56:40', '%Y-%m-%d %H:%M:%S')


@pytest.fixture
def top_five_transactions():

    return [{'date': '02.12.2021', 'amount': -1.07, 'category': 'Каршеринг','description': 'Ситидрайв'},
            {'date': '01.12.2021', 'amount': -99.22, 'category': 'Супермаркеты','description': 'Дикси'}]


@pytest.fixture
def external_api_return():

    return {
        "date": "2018-02-22",
        "historical": "",
        "info": {
            "rate": 148.972231,
            "timestamp": 1519328414},
        "query": {
            "amount": 25,
            "from": "RUB",
            "to": "USD"},
        "result": 48223.05,
        "success": 'true'
    }


@pytest.fixture
def external_api_stock():

    return {
        "Meta Data": {
            "1. Information": "Intraday (5min) open, high, low, close prices and volume",
            "2. Symbol": "IBM",
            "3. Last Refreshed": "2024-07-26 19:55:00",
            "4. Interval": "5min",
            "5. Output Size": "Compact",
            "6. Time Zone": "US/Eastern"
        },
        "Time Series (1min)": {
            "2024-07-26 19:55:00": {
                "1. open": "191.8000",
                "2. high": "192.0000",
                "3. low": "191.8000",
                "4. close": "192.0000",
                "5. volume": "180"}
        }
    }


@pytest.fixture
def operations_excel_file_dataframe():

    return pandas.DataFrame([{'Дата операции': '30.11.2021 18:19:28',
            'Дата платежа': '30.11.2021',
            'Номер карты': '*4556',
            'Статус': 'OK',
            'Сумма операции': -95.0,
            'Валюта операции': 'RUB',
            'Сумма платежа': -95.0,
            'Валюта платежа': 'RUB',
            'Кэшбэк': 'nan',
            'Категория': 'Фастфуд',
            'MCC': 5814.0,
            'Описание': 'IP Nelikaev',
            'Бонусы (включая кэшбэк)': 0,
            'Округление на инвесткопилку': 0,
            'Сумма операции с округлением': 95.0},
        {'Дата операции': '30.11.2021 10:41:46',
        'Дата платежа': '30.11.2021',
             'Номер карты': '*4556',
             'Статус': 'OK',
             'Сумма операции': -103.0,
             'Валюта операции': 'RUB',
             'Сумма платежа': -103.0,
            'Валюта платежа': 'RUB',
         'Кэшбэк': 5.0,
         'Категория': 'Аптеки',
         'MCC': 5912.0,
         'Описание': 'Аптека Вита',
         'Бонусы (включая кэшбэк)': 5,
         'Округление на инвесткопилку': 0,
         'Сумма операции с округлением': 103.0}])


@pytest.fixture
def operations_excel_file_result():

    return [{'Дата операции': '30.11.2021 18:19:28',
            'Дата платежа': '30.11.2021',
            'Номер карты': '*4556',
            'Статус': 'OK',
            'Сумма операции': -95.0,
            'Валюта операции': 'RUB',
            'Сумма платежа': -95.0,
            'Валюта платежа': 'RUB',
            'Кэшбэк': 'nan',
            'Категория': 'Фастфуд',
            'MCC': 5814.0,
            'Описание': 'IP Nelikaev',
            'Бонусы (включая кэшбэк)': 0,
            'Округление на инвесткопилку': 0,
            'Сумма операции с округлением': 95.0},
            {'Дата операции': '30.11.2021 10:41:46',
            'Дата платежа': '30.11.2021',
            'Номер карты': '*4556',
            'Статус': 'OK',
            'Сумма операции': -103.0,
            'Валюта операции': 'RUB',
            'Сумма платежа': -103.0,
            'Валюта платежа': 'RUB',
            'Кэшбэк': 5.0,
            'Категория': 'Аптеки',
            'MCC': 5912.0,
            'Описание': 'Аптека Вита',
            'Бонусы (включая кэшбэк)': 5,
            'Округление на инвесткопилку': 0,
            'Сумма операции с округлением': 103.0}]


@pytest.fixture
def json_fastfood_result():

    return ('[\n'
 '    {\n'
 '        "Дата операции": "17.06.2020 15:44:56",\n'
 '        "Дата платежа": "17.06.2020",\n'
 '        "Номер карты": "*4556",\n'
 '        "Статус": "OK",\n'
 '        "Сумма операции": 300.0,\n'
 '        "Валюта операции": "RUB",\n'
 '        "Сумма платежа": 300.0,\n'
 '        "Валюта платежа": "RUB",\n'
 '        "Кэшбэк": NaN,\n'
 '        "Категория": "Переводы",\n'
 '        "MCC": NaN,\n'
 '        "Описание": "Владимир Р.",\n'
 '        "Бонусы (включая кэшбэк)": 0,\n'
 '        "Округление на инвесткопилку": 0,\n'
 '        "Сумма операции с округлением": 300.0\n'
 '    }\n'
 ']')


@pytest.fixture
def json_phone_result():

    return ('[\n    {\n        "Дата операции": "18.10.2018 17:01:08",\n        '
            '"Дата платежа": "18.10.2018",\n        '
            '"Номер карты": NaN,\n        '
            '"Статус": "OK",\n        '
            '"Сумма операции": -40.0,\n        '
            '"Валюта операции": "RUB",\n        '
            '"Сумма платежа": -40.0,\n        '
            '"Валюта платежа": "RUB",\n        '
            '"Кэшбэк": NaN,\n        '
            '"Категория": "Мобильная связь",\n        '
            '"MCC": NaN,\n        '
            '"Описание": "Билайн +7 962 717-08-52",\n        '
            '"Бонусы (включая кэшбэк)": 0,\n        '
            '"Округление на инвесткопилку": 0,\n        '
            '"Сумма операции с округлением": 40.0\n    },\n    '
            '{\n        "Дата операции": "18.10.2018 17:00:25",\n        '
            '"Дата платежа": "18.10.2018",\n        '
            '"Номер карты": NaN,\n        '
            '"Статус": "OK",\n        '
            '"Сумма операции": -40.0,\n        '
            '"Валюта операции": "RUB",\n        '
            '"Сумма платежа": -40.0,\n        '
            '"Валюта платежа": "RUB",\n        '
            '"Кэшбэк": NaN,\n        '
            '"Категория": "Мобильная связь",\n        '
            '"MCC": NaN,\n        '
            '"Описание": "Билайн +7 962 717-08-52",\n        '
            '"Бонусы (включая кэшбэк)": 0,\n        '
            '"Округление на инвесткопилку": 0,\n        '
            '"Сумма операции с округлением": 40.0\n    }\n]')
